2016/assignment-13.org
# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Assignment 13, Linear Algebra 1
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2016-04-16 Sat>
#+DESCRIPTION: Third asssignment in the course Linear Algebra 1
#+KEYWORDS: Assignment, Linear Algebra
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{a4wide}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{breqn}
#+LATEX_HEADER: \usepackage{flexisym}
#+LATEX_HEADER: \usepackage{mathstyle}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}
#+LATEX_HEADER: \DeclareMathOperator{\Sp}{Sp}
#+LATEX_HEADER: \DeclareMathOperator{\cis}{cis}

#+BEGIN_SRC emacs-lisp :exports none
  (setq org-latex-pdf-process
          '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -f %f")
          ;; org-latex-listings t
          org-src-fontify-natively t
          ;; org-latex-custom-lang-environments '((maxima "maxima"))
          ;; org-listings-escape-inside '("(*@" . "@*)")
          ;; org-babel-latex-htlatex "htlatex"
          )

    (defmacro by-backend (&rest body)
      `(progn
         (cl-case org-export-current-backend ,@body)))
#+END_SRC

#+RESULTS:
: by-backend

#+BEGIN_LATEX
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\lstnewenvironment{maxima}{%
  \lstset{backgroundcolor=\color{codebg},
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\makeatletter
\renewcommand*\env@matrix[1][*\c@MaxMatrixCols c]{%
  \hskip -\arraycolsep
  \let\@ifnextchar\new@ifnextchar
  \array{#1}}
\makeatother
\clearpage
#+END_LATEX

* Problems

** Problem 1
   1. Find all solutions of $z^3 + 3i\overline{z} = 0$.
   2. Let $z_1, z_2$ be complex numbers.  Prove that unless $z_1z_2 = 1$ and
      $\abs{z_1} = \abs{z_2} = 1$, then $\frac{z_1 + z_2}{1 + z_1z_2}$ is a real
      number.

*** Answer 1
    First, note that zero is a solution of this equation.  Other roots can be
    found as follows:
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        z &=  r\cis \theta \\
        \\
        r^3 \cis(3 \theta) + 3i \cis(-\theta) &= 0 \iff \\
        r^3 \cis(3 \theta) + 3(i \cos(-\theta) + i^2 \sin(-\theta)) &= 0 \iff \\
        r^3 \cis(3 \theta) + 3(i \sin(\theta) + \cos(\theta)) &= 0 \iff \\
        r^3 \cis(3 \theta) + 3 \cis(\theta) &= 0 \iff \\
        r^3 \cis(3 \theta) &= -3 \cis(\theta) \\
        \textit{Equating radius and angle:} & \\
        r^3 &= -3 \iff \\
        r &= -3^{\frac{1}{3}} \\
        3 \theta &= \theta \mod 2\pi \iff \\
        2 \theta &= 0 \mod 2\pi \iff \\
        \theta &= \pi \mod 2\pi \;.
      \end{align*}
    #+END_SRC

    Hence, other roots are:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        z_1 &= -3^{\frac{1}{3}}\cis(0) \\
        z_2 &= -3^{\frac{1}{3}}\cis(\pi)
      \end{align*}
    #+END_SRC

*** Answer 3
    Since $\abs{z_1}^2 = z_1 \overline{z_1} = 1$, we have that $z_1 =
    \overline{z_1} = \frac{1}{z_1}$, and similarly $z_2 = \overline{z_2} =
    \frac{1}{z_2}$.  Further using the properties of complex conjugate we have:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \frac{z_1 + z_2}{1 + z_1z_2} &= \frac{\frac{1}{z_1} + \frac{1}{z_2}}{1 + \frac{1}{z_1z_2}} \\
                                     &= \frac{\overline{z_1} + \overline{z_2}}{1 + \overline{z_1z_2}} \\
                                     &= \overline{\frac{z_1 + z_2}{1 + z_1z_2}}
      \end{align*}
    #+END_SRC

    And since $z = \overline{z} \implies z \in \mathbb{R}$, we have that the given
    expression is real.

** Problem 2
   Let $\mathbb{Q}$ denote the field of rational numbers.  And $K$ defined as follows:
   #+HEADER: :exports results
   #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
   #+BEGIN_SRC latex
     \begin{align*}
     K = \left\{\begin{bmatrix}
           a & 2b \\
           b & a
         \end{bmatrix} \;|\; a,b \in \mathbb{Q}\right\}\;.
     \end{align*}
   #+END_SRC

   Is $K$ a field under matrix addition and multiplication?

