2016/assignment-13.tex
% Created 2016-05-14 Sat 14:38
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage{a4wide}
\usepackage{commath}
\usepackage{amsmath}
\usepackage{marginnote}
\usepackage{enumerate}
\usepackage{listings}
\usepackage{color}
\usepackage{breqn}
\usepackage{flexisym}
\usepackage{mathstyle}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\DeclareMathOperator{\Sp}{Sp}
\DeclareMathOperator{\cis}{cis}
\author{Oleg Sivokon}
\date{\textit{<2016-04-16 Sat>}}
\title{Assignment 13, Linear Algebra 1}
\hypersetup{
  pdfkeywords={Assignment, Linear Algebra},
  pdfsubject={Third asssignment in the course Linear Algebra 1},
  pdfcreator={Emacs 25.1.50.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\lstnewenvironment{maxima}{%
  \lstset{backgroundcolor=\color{codebg},
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\makeatletter
\renewcommand*\env@matrix[1][*\c@MaxMatrixCols c]{%
  \hskip -\arraycolsep
  \let\@ifnextchar\new@ifnextchar
  \array{#1}}
\makeatother
\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}
\begin{enumerate}
\item Find all solutions of $z^3 + 3i\overline{z} = 0$.
\item Let $z_1, z_2$ be complex numbers.  Prove that unless $z_1z_2 = 1$ and
$\abs{z_1} = \abs{z_2} = 1$, then $\frac{z_1 + z_2}{1 + z_1z_2}$ is a real
number.
\end{enumerate}

\subsubsection{Answer 1}
\label{sec-1-1-1}
First, note that zero is a solution of this equation.  Other roots can be
found as follows:

\begin{align*}
  z &=  r\cis \theta \\
  \\
  r^3 \cis(3 \theta) + 3i \cis(-\theta) &= 0 \iff \\
  r^3 \cis(3 \theta) + 3(i \cos(-\theta) + i^2 \sin(-\theta)) &= 0 \iff \\
  r^3 \cis(3 \theta) + 3(i \sin(\theta) + \cos(\theta)) &= 0 \iff \\
  r^3 \cis(3 \theta) + 3 \cis(\theta) &= 0 \iff \\
  r^3 \cis(3 \theta) &= -3 \cis(\theta) \\
  \textit{Equating radius and angle:} & \\
  r^3 &= -3 \iff \\
  r &= -3^{\frac{1}{3}} \\
  3 \theta &= \theta \mod 2\pi \iff \\
  2 \theta &= 0 \mod 2\pi \iff \\
  \theta &= \pi \mod 2\pi \;.
\end{align*}

Hence, other roots are:

\begin{align*}
  z_1 &= -3^{\frac{1}{3}}\cis(0) \\
  z_2 &= -3^{\frac{1}{3}}\cis(\pi)
\end{align*}

\subsubsection{Answer 3}
\label{sec-1-1-2}
Since $\abs{z_1}^2 = z_1 \overline{z_1} = 1$, we have that $z_1 =
    \overline{z_1} = \frac{1}{z_1}$, and similarly $z_2 = \overline{z_2} =
    \frac{1}{z_2}$.  Further using the properties of complex conjugate we have:

\begin{align*}
  \frac{z_1 + z_2}{1 + z_1z_2} &= \frac{\frac{1}{z_1} + \frac{1}{z_2}}{1 + \frac{1}{z_1z_2}} \\
                               &= \frac{\overline{z_1} + \overline{z_2}}{1 + \overline{z_1z_2}} \\
                               &= \overline{\frac{z_1 + z_2}{1 + z_1z_2}}
\end{align*}

And since $z = \overline{z} \implies z \in \mathbb{R}$, we have that the given
expression is real.

\subsection{Problem 2}
\label{sec-1-2}
Let $\mathbb{Q}$ denote the field of rational numbers.  And $K$ defined as follows:
\begin{align*}
K = \left\{\begin{bmatrix}
      a & 2b \\
      b & a
    \end{bmatrix} \;|\; a,b \in \mathbb{Q}\right\}\;.
\end{align*}

Is $K$ a field under matrix addition and multiplication?
