2016/assignment-13.org
*** Answer 3
    Yes, $K$ is a field, following is the illustration of field axioms satisfied
    by $K$.

    1. Closure under addition:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} + 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} =
           \begin{bmatrix}
             a + c & 2(b + d) \\
             b + d & a + c
           \end{bmatrix}
         \end{align*}
       #+END_SRC
       where $(a + c) \in \mathbb{Q} = e$, $(b + d) \in \mathbb{Q} = f$, results in
       a general matrix:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} \in K
         \end{align*}
       #+END_SRC
    2. Closure under multiplication:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} =
           \begin{bmatrix}
             ac + 2db & 2ad + 2bc \\
             bc + ad & 2db + ac
           \end{bmatrix}
         \end{align*}
       #+END_SRC
       where $(ac + 2db) \in \mathbb{Q} = e$ and $2(ad + 2bc) \in \mathbb{Q} =
       f$ and, similarly:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} \in K
         \end{align*}
       #+END_SRC
    3. Associativity of addition:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \left(\begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} + 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix}\right) +
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} =
           \begin{bmatrix}
             a + c & 2(b + d) \\
             b + d & a + c
           \end{bmatrix} +
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} = \\
           \begin{bmatrix}
             a + c + e & 2(b + d + f) \\
             b + d + f & a + c + e
           \end{bmatrix} = \\
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} + 
           \begin{bmatrix}
             c + e & 2(d + f) \\
             d + f & c + e
           \end{bmatrix} =
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} + 
           \left(\begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} +
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix}\right)
         \end{align*}
       #+END_SRC
    4. Associativity of multiplication:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \left(\begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix}\right) \times 
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} =
           \begin{bmatrix}
             ac + 2db & 2ad + 2bc \\
             bc + ad & 2db + ac
           \end{bmatrix} \times 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} = \\
           \begin{bmatrix}
             e(ac + 2db) + f(2ad + 2bc) & 2f(ad + 2db) + e(2ad + 2bc) \\
             e(bc + ad) + f(2db + ac) & 2f(bc + ad) + e(2db + ac)
           \end{bmatrix} = \\
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times
           \begin{bmatrix}
             ec + 2df & 2fc + 2ed \\
             ed + fc & 2fd + ec
           \end{bmatrix} =
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \left(\begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} \times 
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix}\right)
         \end{align*}
       #+END_SRC
    5. Commutativity of addition:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} + 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} =
           \begin{bmatrix}
             a + c & 2(b + d) \\
             b + d & a + c
           \end{bmatrix} = 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} + 
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix}
         \end{align*}
       #+END_SRC
    6. Commutativity of multiplication:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} =
           \begin{bmatrix}
             ac + 2db & 2ad + 2bc \\
             bc + ad & 2db + ac
           \end{bmatrix} = 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} \times
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix}
         \end{align*}
       #+END_SRC
    7. Additive identity is the zero matrix (from matrix addition properties).
    8. Multiplicative identity is the identity matrix (again, from matrix
       multiplication properties).
    9. General inverse under addition:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \left(\begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix}\right)^{-1} =
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} \\
           \textit{where } c + a = 0, d + b = 0 \\
           \textit{i.e. } c = -a, d = -b \\
           \left(\begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix}\right)^{-1} =
           \begin{bmatrix}
             -a & -2b \\
             -b & -a
           \end{bmatrix}
         \end{align*}
       #+END_SRC
    10. General inverse under multiplication.  First, we will find the
        determinant of a generic matrix in $K$:
        #+HEADER: :exports results
        #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
        #+BEGIN_SRC latex
          \begin{align*}
          D = \left|
            \begin{array}{ll}
              a & 2b \\
              b & a
            \end{array} \right| = aa - 2bb = a^2 - 2b^2
          \end{align*}
        #+END_SRC
        Since 2 appears without a pair in the expression $2b^2$, it means that
        the prime factorization of this expression contains an odd number of
        twos.  Hence, it is not possible for $a^2$ to be equal to $2b^2$, unless
        both $a = 0$ and $b = 0$.  Hence, the only element of $K$ which doesn't
        have an inverse is the zero matrix.  For every other element its inverse
        is:
        #+HEADER: :exports results
        #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
        #+BEGIN_SRC latex
          \begin{align*}
            \left(\begin{bmatrix}
              a & 2b \\
              b & a 
            \end{bmatrix}\right)^{-1} =
            \frac{1}{D}\begin{bmatrix}
              a  & -2b \\
              -b & a 
            \end{bmatrix} = 
            \frac{1}{a^2 - 2b^2}\begin{bmatrix}
              a  & -2b \\
              -b & a 
            \end{bmatrix} = 
            \begin{bmatrix}
              \frac{a}{a^2 - 2b^2}  & \frac{-2b}{a^2 - 2b^2} \\
              \frac{-b}{a^2 - 2b^2} & \frac{a}{a^2 - 2b^2}
            \end{bmatrix}
          \end{align*}
        #+END_SRC
        As before, $\frac{a}{a^2 + 2b^2} \in \mathbb{Q} = e$ and $\frac{-b}{a^2 +
        2b^2} \in \mathbb{Q} = f$, hence:
        #+HEADER: :exports results
        #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
        #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix} \in K
         \end{align*}
       #+END_SRC
    11. Finally, distributivity of multiplication over addition:
       #+HEADER: :exports results
       #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
       #+BEGIN_SRC latex
         \begin{align*}
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \left(\begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} + 
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix}\right) =
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \begin{bmatrix}
             c + e & 2(d + f) \\
             d + f & c + e 
           \end{bmatrix} = \\
           \begin{bmatrix}
             a(c + e) + 2b(d + f) & 2b(c + e) + 2a(d + f) \\
             a(d + f) + b(c + e)  & 2b(d + f) + a(c + e)
           \end{bmatrix} = \\
           \begin{bmatrix}
             ac + 2bd & 2ad + 2bc \\
             bc + ad & 2bd + ac
           \end{bmatrix} + 
           \begin{bmatrix}
             ae + 2bf & 2af + 2be \\
             be + af & 2bf + ae
           \end{bmatrix} = \\  
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \begin{bmatrix}
             c & 2d \\
             d & c
           \end{bmatrix} + 
           \begin{bmatrix}
             a & 2b \\
             b & a
           \end{bmatrix} \times 
           \begin{bmatrix}
             e & 2f \\
             f & e
           \end{bmatrix}
         \end{align*}
      #+END_SRC

