2016/assignment-13.tex

\subsection{Problem 3}
\label{sec-1-3}
Verify that $V$ is a vectors space over field $\textbf{F}$:
\begin{enumerate}
\item $\textbf{F} = \mathbb{C}, V = \mathbb{M}_{n\times n}^{\mathbb{C}}$ and
addition defined to be the regular addition, while multiplication is
defined to be $\lambda\times A = \abs{\lambda}\times A$.
\item $\textbf{F} = \mathbb{R}, V = \{(x,y) \in \mathbb{R}^2\;|\;y=2x\}$,
with addition being the addition of $\mathbb{R}^2$ and multiplication
$\lambda\times (x,y) = (\lambda x, 0)$.
\end{enumerate}

\subsubsection{Answer 5}
\label{sec-1-3-1}
\begin{enumerate}
\item Distributivity of scalar addition prevents $V$ from being a field over
$\textbf{F}$.  Consider this example:
\begin{align*}
  \abs{-1+i} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} +
  \abs{1-i} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} &= \\
  \sqrt{(-1)^2+1^2} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} +
  \sqrt{1^2+(-1)^2} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} &=
  \begin{bmatrix}
    2\sqrt{2} & 0 \\
    0 & 2\sqrt{2}
  \end{bmatrix}
\end{align*}

while, at the same time:
\begin{align*}
  \abs{(-1+i) + (1-i)} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} = 
  \sqrt{0^2+0^2} \times
  \begin{bmatrix}
    1 & 0 \\
    0 & 1
  \end{bmatrix} &=
  \begin{bmatrix}
    0 & 0 \\
    0 & 0
  \end{bmatrix}
\end{align*}

Obviously, 
\begin{align*}
  \begin{bmatrix}
    2\sqrt{2} & 0 \\
    0 & 2\sqrt{2}
  \end{bmatrix} \neq 
  \begin{bmatrix}
    0 & 0 \\
    0 & 0
  \end{bmatrix}
\end{align*}

\item Of course $V$ is not a vector space over $\mathbf{F}$, almost none of
scalar multiples are in $V$, since they are of the form $(x, y)$, where
$y = 0$ and $y = 2x$, but this is only true when $x = 0$ as well.  Any
other value of $x$ will not satisfy closure under multiplication
requirement.
\end{enumerate}

\subsection{Problem 4}
\label{sec-1-4}
Given sets:
\begin{enumerate}
\item $K = \{(x,y,z,t) \in \mathbb{R}^4\;|\; x+y-z+t=0 \land 2x+y+z-3t=0\}$.
\item $L = \{f \in V\;|\; f\left(\frac{1}{2}\right)>f(2)\}$, $V$ is the vector
space of all real-valued functions.
\item $M = \{p(x) \in \mathbb{R}^4[x]\;|\; p(-3) = 0\}$.
\item $R = \{(x,y) \in \mathbb{R}^3\;|\; x^2 + y^2 = 0\}$.
\item $R = \{(x,y) \in \mathbb{R}^3\;|\; x^2 - y^2 = 0\}$.
\end{enumerate}

Fore each of sets given, assert them being vector spaces.  In case they are,
prove this in two different ways.

\subsubsection{Answer 6}
\label{sec-1-4-1}
\begin{enumerate}
\item By substitution find that $x = 4t - 2z$, $y = 3z - 5t$.  This gives us
vectors $\vec{v}_1 = (4, -5, 0, 1)^T$ and $\vec{v}_2 = (-2, 3, 1, 0)^T$
which span $K$.  In other words, $K$ is a vector space over the field of
real numbers with the operations of vector addition and multiplication.
\item $L$ is not a vector space.  For example, it doesn't have additive
inverse.  Suppose for contradiction that there exists additive inverse in
$L$, then $f(x) + f'(x) = 0$, in particular, $f(\frac{1}{2}) +
       f'(\frac{1}{2}) = 0$ and $f(2) + f'(2) = 0$.  We know that
$f(\frac{1}{2}) > f(2)$.  Let $f(\frac{1}{2}) = n$ and $f(2) = m$.  Then
$f'(\frac{1}{2}) = -n$ and $f'(2) = -m$.  However, if $n > m$, then $-n <
       -m$.  Contradiction.  Hence, $L$ is not a vector space.
\item $M$ is a vector space with the span $P = \Sp\{(1, 0, 0, (-3)^3), (0, 1,
       0, (-3)^2), (0, 0, 1, (-3)^1), \allowbreak (0, 0, 0, 0)\}$.  To see why
these vectors span $M$ suppose there was a polinomial $p(x)$ s.t. $p(-3)
       = 0$, but it is not a linear combination of $P$.  However, $p(x)$ must be
representable as follows $(\alpha(-3)^3 - c_{\alpha}) + (\beta(-3)^2 -
       c_{\beta}) + (\gamma(-3)^1 - c_{\gamma}) = 0$, with $c_i$ some constants.
Now, note that each of the summands individually can be represented by
the elements of $P$, hence, contrary to assumed, $p(x)$ is a linear
combinaton of $P$.  Hence, $P$ spans $M$.
\item $R$ is a vector space, if you allow vector spaces with just one element:
the condition $x^2+y^2=0$ in real numbers can only be satisfied when
$x=y=0$, since squares of real numbers are non-negative.  This space
would be the $\Sp\{(0, 0)\}$.
\item $S$ is a vector space defined by $\Sp\{(1, 1), (0, 0)\}$, it is equivalent
to just the real numbers.
\end{enumerate}

\subsection{Problem 5}
\label{sec-1-5}
Given vector space $V$ and $\vec{v}_1, \vec{v}_2, \vec{v}_3$ distinct vectors
prove or disprove:
\begin{enumerate}
\item If $\Sp\{\vec{v}_1, \vec{v}_2\} = \Sp\{\vec{v}_1, \vec{v}_3\}$, then
$\vec{v}_2$ is a multiple of $\vec{v}_3$.
\item If $\vec{v}_1 - 2\vec{v}_2 + \vec{v}_3 = \vec{0}$, then 
$\Sp\{\vec{v}_1, \vec{v}_2\} = \Sp\{\vec{v}_1, \vec{v}_3\}$.
\item If $\{\vec{v}_1, \vec{v}_2, \vec{v}_3\}$ is linearly dependent, then
$\Sp\{\vec{v}_1, \vec{v}_2\} = \Sp\{\vec{v}_1 + \vec{v}_3, \vec{v}_2 +
      \vec{v}_3\}$.
\end{enumerate}

\subsubsection{Answer 7}
\label{sec-1-5-1}
\begin{enumerate}
\item False, counterexample: $\vec{v}_1 = (1, 0)^T$, $\vec{v}_2 = (1, 1)^T$,
$\vec{v}_3 = (0, 1)^T$, but there doesn't exist $\lambda$ s.t.
$\lambda \vec{v}_2 = \vec{v}_3$.
\item True, take any vector generated by the first span: 
\begin{align*}
  \vec{x} &= \alpha(2\vec{v}_2 - \vec{v}_3) + \beta \vec{v}_2 \\
  \vec{y} &= \gamma(2\vec{v}_2 - \vec{v}_3) + \delta \vec{v}_3 \\
  &\textit{Group the coefficients: } \\
  \vec{x} &= (2\alpha + \beta) \vec{v}_2 - \alpha \vec{v}_3 \\
  \vec{y} &= 2\gamma \vec{v}_2 - (\delta - \gamma) \vec{v}_3
\end{align*}

Since both $\vec{x}$ and $\vec{y}$ are linear combinations of $\vec{v}_2$
and $\vec{v}_3$, they are in the same span.  Hence $\Sp\{\vec{v}_1,
       \vec{v}_2\} = \Sp\{\vec{v}_1, \vec{v}_3\}$.
\item False, counterexample: $\vec{v}_1 = (0, 0)^T$, $\vec{v}_2 = (1, 0)^T$,
$\vec{v}_3 = (0, 1)^T$, but $\dim\Sp\{\vec{v}_1, \vec{v}_2\} = 1$ and
$\dim\Sp\{\vec{v}_2, \vec{v}_3\} = 2$.
\end{enumerate}

\subsection{Problem 6}
\label{sec-1-6}
Given following subspaces of $\mathbb{R}^3$:
$U = \Sp\{(1,1,2), (2,2,1)\}$ and $W = \Sp\{(1,3,4), (2,5,1)\}$,
find spanning set of $U \cap W$.
