2016/assignment-13.org
*** Answer 8
    Using linear space sum dimension theorem: $\dim(W + U) = \dim W + \dim U -
    \dim(W \cap U)$ we have that $\dim(W \cap U) = \dim W + \dim U - \dim(W +
    U)$.
    Now, let's find the summands:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        \dim{U} &= \dim \left(\begin{bmatrix}
                 1 & 1 & 2 \\
                 2 & 2 & 1
               \end{bmatrix} \right) \\
                &= \dim \left(\begin{bmatrix}
                 1 & 1 & 2 \\
                 0 & 0 & -3
               \end{bmatrix} \right) \\
                &= 2\;. \\
        \dim{W} &= \dim \left(\begin{bmatrix}
                 1 & 3 & 4 \\
                 2 & 5 & 1
               \end{bmatrix} \right) \\
                &= \dim \left(\begin{bmatrix}
                 1 & 1  & 2 \\
                 0 & -1 & -7
               \end{bmatrix} \right) \\
                &= 2\;. \\
        \dim(W + U) &= \dim \left(\begin{bmatrix}
                 1 & 3  & 4 \\
                 0 & -1 & -7 \\
                 1 & 1  & 2 \\
                 0 & 0  & -3
               \end{bmatrix} \right) \\
                &= \dim \left(\begin{bmatrix}
                 1 & 3  & 4 \\
                 0 & -1 & -7 \\
                 0 & -2 & 2 \\
                 0 & 0  & -3
               \end{bmatrix} \right) \\
                &= \dim \left(\begin{bmatrix}
                 1 & 3  & 4 \\
                 0 & -1 & -7 \\
                 0 & 0  & 16 \\
                 0 & 0  & -3
               \end{bmatrix} \right) \\
                &= \dim \left(\begin{bmatrix}
                 1 & 3  & 4 \\
                 0 & -1 & -7 \\
                 0 & 0  & 16 \\
                 0 & 0  & 0
               \end{bmatrix} \right) \\
                &= 3\;.
      \end{align*}
    #+END_SRC
    Imporatnt observation here is that the number of pivot elements in reduced
    echelon form is the dimension of the matrix.

    Hence, $\dim(W \cap U) = 2 + 2 - 3 = 1$, or, in other words, $U$ and $W$
    share one common axis.
